tap "altnode-org/tap"
tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "carlocab/personal"
tap "dart-lang/dart"
tap "gcenx/wine"
tap "leoafarias/fvm"
tap "minacle/chntpw"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "playcover/playcover"
tap "qmk/qmk"
tap "sidneys/homebrew"
tap "supabase/tap"
brew "act"
brew "aom"
brew "gettext"
brew "aria2"
brew "boost"
brew "avrdude"
brew "azure-cli"
brew "biome"
brew "bison"
brew "cabextract"
brew "glib"
brew "cdrtools"
brew "chezmoi"
brew "cmake"
brew "cocoapods"
brew "libtiff"
brew "duckdb"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-lfs"
brew "github-mcp-server"
brew "unbound"
brew "libgpg-error"
brew "go"
brew "go-task"
brew "harfbuzz"
brew "hugo"
brew "jpeg-xl"
brew "jq"
brew "libass"
brew "lld"
brew "mas"
brew "openjdk"
brew "maven"
brew "mcp-proxy"
brew "yt-dlp"
brew "mpv"
brew "pandoc"
brew "pango"
brew "pillow"
brew "pinentry-mac"
brew "platformio"
brew "poetry"
brew "poppler"
brew "protobuf"
brew "pyenv"
brew "rclone"
brew "ruby-build"
brew "rust"
brew "shairport-sync"
brew "sherlock"
brew "swift-format"
brew "tesseract"
brew "uv"
brew "volta"
brew "wget"
brew "wimlib"
brew "winetricks"
brew "zinit"
brew "altnode-org/tap/git-lfs-agent-rclone"
brew "carlocab/personal/unrar"
brew "leoafarias/fvm/fvm"
brew "minacle/chntpw/chntpw"
brew "osx-cross/avr/avr-gcc@9"
brew "qmk/qmk/qmk"
brew "supabase/tap/supabase"
cask "android-studio"
cask "applite"
cask "arc"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "clockify"
cask "codex"
cask "cursor"
cask "docker-desktop"
cask "font-sf-mono"
cask "font-sf-pro"
cask "git-credential-manager"
cask "google-chrome"
cask "gstreamer-runtime"
cask "insomnia"
cask "jordanbaird-ice"
cask "macs-fan-control"
cask "ngrok"
cask "notion"
cask "postico"
cask "raycast"
cask "stats"
cask "thebrowsercompany-dia"
cask "visual-studio-code"
cask "wireshark-app"
cask "xcodes-app"
mas "Amphetamine", id: 937984704
mas "Delete Apps", id: 1033808943
mas "Developer", id: 640199958
mas "Keynote", id: 409183694
mas "NordLayer", id: 1488888843
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Structured", id: 1499198946
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
vscode "1yib.rust-bundle"
vscode "asuka.insertnumbers"
vscode "berublan.vscode-log-viewer"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dustypomerleau.rust-syntax"
vscode "editorconfig.editorconfig"
vscode "fill-labs.dependi"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeroen-meijer.pubspec-assist"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "marus25.cortex-debug"
vscode "mathiasfrohlich.kotlin"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nmsmith89.incrementor"
vscode "ozaki.markdown-github-dark"
vscode "perkovec.emoji"
vscode "pimzino.spec-workflow-mcp"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "ronaldosena.arduino-snippets"
vscode "rust-lang.rust-analyzer"
vscode "sirmspencer.vscode-autohide"
vscode "solomonkinard.git-blame"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "task.vscode-task"
vscode "toba.vsfire"
vscode "trond-snekvik.gnu-mapfiles"
vscode "vadimcn.vscode-lldb"
vscode "wmaurer.change-case"
npm "corepack"
