tap "carlocab/personal"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/services"
tap "minacle/chntpw"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sidneys/homebrew"
tap "supabase/tap"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "gettext"
brew "aria2"
brew "boost"
brew "avrdude"
brew "cabextract"
brew "glib"
brew "cdrtools"
brew "chezmoi"
brew "cmake"
brew "unbound"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "go-task"
brew "hugo"
brew "libgpg-error"
brew "mas"
brew "node"
brew "openvino"
brew "pillow", link: false
brew "pinentry-mac"
brew "platformio", link: false
brew "protobuf"
brew "pulseaudio", restart_service: true
brew "python@3.10"
brew "ruby-build"
brew "rust"
brew "shairport-sync"
brew "sherlock"
brew "swift-format"
brew "wget"
brew "wimlib"
brew "youtube-dl"
brew "carlocab/personal/unrar"
brew "minacle/chntpw/chntpw"
brew "qmk/qmk/qmk"
brew "supabase/tap/supabase"
cask "altserver"
cask "android-studio"
cask "applite"
cask "arc"
cask "blackhole-2ch"
cask "chatgpt"
cask "deepl"
cask "discord"
cask "docker"
cask "epic-games"
cask "gimp"
cask "inkscape"
cask "insomnia"
cask "jordanbaird-ice"
cask "notion"
cask "notion-calendar"
cask "stats"
cask "steam"
cask "visual-studio-code"
cask "vivaldi"
cask "whisky"
cask "wine-stable"
cask "wireshark"
cask "xcodes"
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Delete Apps", id: 1033808943
mas "Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Slack", id: 803453959
mas "Structured", id: 1499198946
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
vscode "1yib.rust-bundle"
vscode "asuka.insertnumbers"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "fill-labs.dependi"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeroen-meijer.pubspec-assist"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mariusvanwijk-joppekoers.codam-norminette-3"
vscode "marus25.cortex-debug"
vscode "mathiasfrohlich.kotlin"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "nmsmith89.incrementor"
vscode "ozaki.markdown-github-dark"
vscode "perkovec.emoji"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "ronaldosena.arduino-snippets"
vscode "rust-lang.rust-analyzer"
vscode "sirmspencer.vscode-autohide"
vscode "solomonkinard.git-blame"
vscode "sswg.swift-lang"
vscode "toba.vsfire"
vscode "trond-snekvik.gnu-mapfiles"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vknabel.vscode-apple-swift-format"
vscode "wakatime.vscode-wakatime"
vscode "wmaurer.change-case"
vscode "xaver.clang-format"
